Tekla.Structures.ModelInternal.dotReferenceModelRevision_t
Struct for the reference model revision.

Tekla.Structures.ModelInternal.dotReferenceModelRevision_t.Year
Revision date: Year

Tekla.Structures.ModelInternal.dotReferenceModelRevision_t.Month
Revision date: Month

Tekla.Structures.ModelInternal.dotReferenceModelRevision_t.Day
Revision date: Day

Tekla.Structures.ModelInternal.dotReferenceModelRevision_t.Hour
Revision date: Hour

Tekla.Structures.ModelInternal.dotReferenceModelRevision_t.Minute
Revision date: Minute

Tekla.Structures.ModelInternal.dotReferenceModelRevision_t.Second
Revision date: Second

Tekla.Structures.ModelInternal.dotReferenceModelRevision_t.IsCurrentRevision
The value indicating whether this revision is the current revision.

Tekla.Structures.ModelInternal.dotReferenceModelRevision_t.DbId
The database id of the revision.

Tekla.Structures.ModelInternal.dotReferenceModelRevision_t.aIdentifier
The string identifier of the revision.

Tekla.Structures.ModelInternal.dotReferenceModelRevision_t.aFileName
The file name of the revision.